#coding:utf-8

def find_common_strings(arr1, arr2):
    set2 = set(arr2)  # 将arr2转换为集合，以便进行快速查询
    common_strings = [s for s in arr1 if s not in set2]  # 使用列表推导式查找在arr2中出现的字符串
    return common_strings


arr1 = ['冯密宇', '黄俊', '李彬', '刘嘉宇', '刘岩磊', '刘知用', '孙晨仪', '王乐航', '尤旭东', '丁璇', '范宇', '胡志恒', '李家豪', '李雨婷', '潘波', '田家吉', '涂书瑞', '王琦', '吴宇飞', '于卫超', '余新宇', '余志敏', '张克勤', '张思乐', '左训斌', '单宁怡', '邓立桐', '范财胜', '高曼桢', '葛柯成', '蒋觉慧', '柯善一', '李骏然', '潘鑫宇', '孙梦茹', '孙跃文', '喻思远', '祝科伟', '杜婉霖', '胡茗宇', '户保祝', '华瑞哲', '华子韬', '开健', '李昊', '李蔚明', '潘昊', '田卓岩', '王嘉禾', '王越瑶', '杨美子', '张玉祥', '蔡尚宸', '冯立豪', '顾博闻', '何蕴淇', '洪世曜', '黄智诚', '李金龙', '李欣珂', '李治兴', '林婉婷', '苏荣朋', '王浩然', '王少丰', '王银哲', '谢瀚然', '邢玉杰', '叶星蔚', '余耀桦', '张皓岚', '张珂宇', '张鹏', '张志成', '石昭', '宋德浩', '孙浩', '万杰', '温振宇', '吴迪高', '战翔宇', '张恩灿', '张槐琳', '赵家功', '郑子未', '曾仕磊', '董奕恒', '高倩文', '郭嘉豪', '黄浩崧', '蒋中盛', '李鸿波', '梁雨欣', '刘安琪', '刘龙亮', '钱子轩', '宋悦豪', '汤报', '王世康', '王文轩', '徐恩洁', '杨浩', '张璨', '张文睿', '张肇星', '张智博', '蔡兴伟', '曹彬', '陈梦荞', '陈芃', '陈艺文', '廖玺', '林克鹏', '林政宏', '欧阳彪', '乔佳斌', '孙亚南', '王思诺', '周本宽', '陈浩哲', '陈升', '陈义和', '程盈盈', '程志文', '何佳旭', '何一鸣', '贾永祺', '康媞', '李明键', '倪裕欣', '孙乐', '徐静', '徐泽宇', '徐志刚', '姚瑜洋', '余坤', '张婧', '周涵琪', '朱昊頔']
arr2 = ['李彬', '孙梦茹', '郑文捷', '熊子雯', '张姮', '汤报', '张文睿', '杨浩', '张智博', '孙亚南', '王世康', '王宁', '邓立桐', '李鸿波', '董奕恒', '王伟建', '刘龙亮', '王思诺', '刘安琪', '温振宇', '郑子未', '潘昊', '张展豪', '吴以杰', '刘知用', '刘岩磊', '林政宏', '张恩灿', '张璨', '尤旭东', '李岩蒲', '黄浩崧', '刘家昕', '胡继元', '赵屹珉', '郭富伟', '孙千里', '蒋小星', '聂瑞丰', '谢可心', '曾庆阳', '涂增基', '张宇豪', '吴迪高', '卢俊', '孙晨仪', '高曼桢', '于卫超', '丁婷玉', '蒋觉慧', '江宇', '张肇星', '李昊', '段芝慧', '邓捷', '孙睿泽', '潘鑫宇', '王乐航', '张博帅', '王浩然', '吴宇飞', '曲伯识', '陈鑫', '张思乐', '欧阳彪', '张培宇', '黄智诚', '余新宇', '周毅', '谢瀚然', '汪天健', '黄龙海', '金帅', '周景龙', '时豪', '田同双', '胡志恒', '汪昀楷', '李骏然', '陈盈盈', '冯密宇', '刘嘉宇', '蒋中盛', '彭铭清', '麻天轶', '许月阳', '张泽宇', '周楚骎', '石昭', '乔佳斌', '林克鹏', '开健', '宋悦豪', '王琦', '王李懿', '蒋艺', '陈芃', '陈艺文', '邢玉杰', '宋鸣飞', '唐木林', '徐敏哲', '胡志杰', '葛晗芳', '吴婧尧', '陈杰', '郭嘉豪', '祝科伟', '曾仕磊', '王越瑶', '高倩文', '余洪杰', '李蔚明', '钱子轩', '姜丝雨', '陈星宇', '陈梦荞', '王桢华', '王宇哲', '杜君豪', '汪金剑', '申牧原', '易昊', '戴澍', '高信', '时圣智', '李鹏坤', '贾然钧', '吴和培', '田家吉', '王烨', '王嘉禾', '曹婧岚', '戢林飞']
a = find_common_strings(arr2, arr1)
print(a)
print(len(a))
print(len(arr1))
